content/posts/coq.md
+++
title = "Coq"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T22:53:10-07:00
slug = "coq"
draft = false
+++

Coq is a theorem prover that uses principles from type theory to provide formalizations of programs.


## Libraries {#libraries}

<https://github.com/DeepSpec/InteractionTrees> a neat representation of recursive and impure Coq programs
<https://github.com/mattam82/Coq-Equations> function definitions for Coq
<https://github.com/MetaCoq/metacoq> metaprogramming


## References {#references}

<https://github.com/atharvashukla/coq-tactics-index> index of coq tactics and their meanings
<https://github.com/UniMath/UniMath> coq and math?
<https://github.com/codyroux/name-the-biggest-number> proving the biggest number in coq constructively
